viktors_ingredients = ['чушки', 'домати', 'моркови', 'ябълки', 'сол', 'черен пипер', 'кимион', 'зехтин']
georgis_ingredients = ('чушки', 'домати', 'патладжан', 'люти чушки', 'олио', 'захар', 'чубрица', 'черен пипер', 'врачанска ракия')
shopping_list = ["чушки", "домати", "моркови", "ябълки", "сол", "черен пипер", "кимион", "зехтин", "чушки", "домати", "патладжан", "люти чушки", "олио", "захар", "чубрица", "черен пипер", "врачанска ракия"]
shopping_list.reverse()
unique_ingredients = set(shopping_list)
ingredient_quantities = {
    'черен пипер': 5,
    'врачанска ракия': 5,
    'захар': 5,
    'люти чушки': 5,
    'кимион': 5,
    'домати': 5,
    'чубрица': 5,
    'моркови': 5,
    'чушки': 5,
    'сол': 5,
    'патладжан': 5,
    'ябълки': 5,
    'олио': 5,
    'зехтин': 5,
    'skyr': 1
}
number_of_ingredients_to_buy = len(unique_ingredients)
print(shopping_list)